--Вывод статистики по средней зарплате, минимальному значению и максимальному

SELECT ROUND(AVG(salary_from)) AS avg_from,
       ROUND(AVG(salary_to)) AS avg_to,
       MIN(salary_from) AS min_from,
       MIN(salary_to) AS min_to,
       MAX(salary_from) AS max_from,
       MAX(salary_to) AS max_to
FROM public.parcing_table;

avg_from|avg_to|min_from|min_to |max_from|max_to  |
--------+------+--------+-------+--------+--------+
  109525|153847|    50.0|25000.0|398000.0|497500.0|

-- В среднем готовы платить 130 тысяч рублей специалисту, но данных недостаточно, многие не указывают зарплату и от компании к компании сумма разнится - далее это будет видно. Число 50 очевидно является ошибкой




--Выявил топ-10 регионов, в которых больше всего открытых вакансий

SELECT area,
	count(*) AS count_area
FROM public.parcing_table
GROUP BY area
ORDER BY count_area DESC
LIMIT 10;

area           |count_area|
---------------+----------+
Москва         |      1247|
Санкт-Петербург|       181|
Екатеринбург   |        51|
Нижний Новгород|        33|
Новосибирск    |        33|
Владивосток    |        31|
Казань         |        29|
Краснодар      |        22|
Самара         |        11|
Ростов-на-Дону |        10|

--Очевидно преобладание крупных городов. В основном в европейской части России. Новосибирск и Владивосток единственные представители Зауралья



--Аналогично выявлены топ-10 по работодателям

SELECT employer,
	count(*) AS count_employer
FROM public.parcing_table
GROUP BY employer
ORDER BY count_employer DESC
LIMIT 10;

employer                             |count_employer|
-------------------------------------+--------------+
СБЕР                                 |           243|
WILDBERRIES                          |            43|
Ozon                                 |            34|
Банк ВТБ (ПАО)                       |            28|
Т1                                   |            26|
МАГНИТ, Розничная сеть               |            24|
МТС                                  |            22|
Okko                                 |            19|
Центральный банк Российской Федерации|            16|
Правительство Москвы                 |            15|


-- С большим отрывом лидирует Сбер. Далее идут маркетплейсы. Примерно одинаковое количество вакансий у банков и операторов связи. Много вакансий в государственных структурах



-- Таблицы по занятости и графику работы

SELECT employment,
	count(*) AS count_employment
FROM public.parcing_table
GROUP BY employment 
ORDER BY count_employment DESC;

employment         |count_employment|
-------------------+----------------+
Полная занятость   |            1764|
Частичная занятость|              16|
Стажировка         |              16|
Проектная работа   |               5|


SELECT schedule,
	count(*) AS count_schedule
FROM public.parcing_table
GROUP BY schedule 
ORDER BY count_schedule DESC;

schedule        |count_schedule|
----------------+--------------+
Полный день     |          1441|
Удаленная работа|           310|
Гибкий график   |            41|
Сменный график  |             9|

-- Полная занятость и день лидируют. Есть часть вакансий удаленно, остальных единицы - аналитики нужны именно в офис и на полную ставку



-- Распределение вакансий по грейдам

SELECT experience,
	count(*) AS count_exp
FROM public.parcing_table
GROUP BY experience
ORDER BY count_exp DESC;

experience           |count_exp|
---------------------+---------+
Junior+ (1-3 years)  |     1091|
Middle (3-6 years)   |      555|
Junior (no experince)|      142|
Senior (6+ years)    |       13|

-- Больше всего спрос на средних специалистов(джуны с небольшим опытом и самостоятельные мидлы). Немудрено, что нужны джуны, ведь их обучить и удержать проще мидлов




-- Распределение вакансий по компаниям, средней зарплате и условий труда - топ-30 для примера

SELECT employer,
	count(*) AS num_job,
	round(avg(salary_from)) AS avg_from,
	round(avg(salary_to)) AS avg_to,
	schedule,
	employment
FROM public.parcing_table
GROUP BY employer, schedule, employment 
ORDER BY num_job DESC
LIMIT 30;

employer                                   |num_job|avg_from|avg_to|schedule        |employment      |
-------------------------------------------+-------+--------+------+----------------+----------------+
СБЕР                                       |    239|  115600|102000|Полный день     |Полная занятость|
WILDBERRIES                                |     31|  180000|220000|Полный день     |Полная занятость|
Банк ВТБ (ПАО)                             |     28|        |      |Полный день     |Полная занятость|
Ozon                                       |     24|        |      |Полный день     |Полная занятость|
МТС                                        |     21|   67500|      |Полный день     |Полная занятость|
Т1                                         |     20|        |      |Полный день     |Полная занятость|
Okko                                       |     19|        |      |Полный день     |Полная занятость|
Центральный банк Российской Федерации      |     16|        |      |Полный день     |Полная занятость|
Яндекс                                     |     15|        |      |Полный день     |Полная занятость|
Правительство Москвы                       |     15|        |      |Полный день     |Полная занятость|
Райффайзен Банк                            |     14|        |      |Полный день     |Полная занятость|
МАГНИТ, Розничная сеть                     |     14|        |      |Удаленная работа|Полная занятость|
Московская Биржа                           |     13|        |      |Полный день     |Полная занятость|
ГКУ Центр занятости населения города Москвы|     12|  101667|108000|Полный день     |Полная занятость|
Ростелеком                                 |     11|        |100000|Удаленная работа|Полная занятость|
Марс                                       |     10|        |      |Полный день     |Полная занятость|
WILDBERRIES                                |     10|        |      |Удаленная работа|Полная занятость|
МАГНИТ, Розничная сеть                     |     10|   80714| 81667|Полный день     |Полная занятость|
Деловые Линии                              |     10|  118200|136000|Полный день     |Полная занятость|
INGURU.RU                                  |      9|  200000|300000|Удаленная работа|Полная занятость|
Центр финансовых технологий                |      9|        |      |Полный день     |Полная занятость|
DNS Технологии                             |      8|   77500|135000|Полный день     |Полная занятость|
ANCOR                                      |      8|  300000|228000|Полный день     |Полная занятость|
ГКУ Инфогород                              |      8|        |      |Полный день     |Полная занятость|
Московский Кредитный Банк                  |      8|        |      |Полный день     |Полная занятость|
Комус                                      |      8|        |      |Полный день     |Полная занятость|
Ozon                                       |      8|        |      |Удаленная работа|Полная занятость|
DNS Головной офис                          |      8|   73750| 92000|Полный день     |Полная занятость|
Maxim technology                           |      8|        |      |Полный день     |Полная занятость|
USETECH                                    |      8|        |      |Полный день     |Полная занятость|

-- Здесь видим подтверждение предыдущим выводам и статистике - в лидерах банки, маркетплейсы и телеком. Важен момент, что очень мало компаний указывает зарплату. Также подтверждение необходимости сотрудников на полную занятость и день





-- Сбор статистики по необходимым навыкам по первому ключевому навыку key_skills_1

SELECT key_skills_1,
       COUNT(*) AS count_key
FROM public.parcing_table 
GROUP BY key_skills_1 
ORDER BY count_key DESC;


key_skills_1                                                    |num_mention|
----------------------------------------------------------------+-----------+
                                                                |        383|
Анализ данных                                                   |        312|
SQL                                                             |        161|
Документация                                                    |         89|
MS SQL                                                          |         87|
Pandas                                                          |         86|
Аналитическое мышление                                          |         80|
Коммуникация                                                    |         69|
Python                                                          |         67|
confluence                                                      |         47|
Английский язык                                                 |         38|
Power BI                                                        |         32|
Проактивность                                                   |         31|
MS PowerPoint                                                   |         26|
Numpy                                                           |         20|
A/B тесты                                                       |         19|
Machine Learning                                                |         13|
Грамотная речь                                                  |          8|
Linux                                                           |          7|
Kafka                                                           |          6|
Способность к саморазвитию                                      |          6|
FineBI                                                          |          6|
1С: Предприятие 8                                               |          6|
Юнит-экономика                                                  |          6|
Excel                                                           |          6|
Knime                                                           |          5|
Teradata                                                        |          5|
Визуализация данных                                             |          4|
Работа в команде                                                |          4|
MS Excel                                                        |          4|
Автоматизация процессов                                         |          4|
Аналитика продаж                                                |          4|
Переговоры                                                      |          4|
Математическая статистика                                       |          3|
сводные таблицы                                                 |          3|
Sas                                                             |          3|
Креативность                                                    |          3|
Портфельные риски                                               |          3|
DataLens                                                        |          3|
Hadoop                                                          |          3|
Работа с большим объемом информации                             |          3|
Deep Learning                                                   |          3|
Работа с базами данных                                          |          3|
Внутренний контроль                                             |          3|
Tableau                                                         |          3|
MongoDB                                                         |          2|
Сбор и анализ информации                                        |          2|
Деловая переписка                                               |          2|
Системный анализ                                                |          2|
Airflow                                                         |          2|
База данных: Olap                                               |          2|
Аудит                                                           |          2|
Логистика                                                       |          2|
ETL                                                             |          2|
R                                                               |          2|
Деловая коммуникация                                            |          2|
SQLite                                                          |          2|
аналитик данных                                                 |          2|
Apache SuperSet                                                 |          2|
DWH Lead                                                        |          2|
SQL-запросы                                                     |          2|
MDM                                                             |          2|
База данных: Oracle                                             |          2|
AB-test                                                         |          2|
Принятие решений                                                |          2|
BI                                                              |          2|
Расчет заработной платы                                         |          2|
Cистемы управления базами данных                                |          2|
Решение проблем                                                 |          2|
Apache Spark                                                    |          2|
Торговая площадка                                               |          2|
IBM Unica                                                       |          1|
StreamLit                                                       |          1|
Работа с системами аналитики                                    |          1|
Амплитуда                                                       |          1|
Аудиторские проверки                                            |          1|
Усидчивость                                                     |          1|
Бизнес-анализ                                                   |          1|
Archimate                                                       |          1|
MS Project                                                      |          1|
power bi                                                        |          1|
data science                                                    |          1|
Аналитические способности                                       |          1|
ADODB                                                           |          1|
Аналитика по клиентам                                           |          1|
Ответственность, внимательность                                 |          1|
Подготовка презентаций                                          |          1|
Инструменты BI                                                  |          1|
Данных                                                          |          1|
pyspark                                                         |          1|
стажер                                                          |          1|
Business Intelligence Systems                                   |          1|
ООП                                                             |          1|
Debezium                                                        |          1|
Корпоративные финансы                                           |          1|
Финансовый контроль                                             |          1|
REST                                                            |          1|
ClickHouse                                                      |          1|
Ad Hoc Analysis                                                 |          1|
runtime CRM                                                     |          1|
A/B/n                                                           |          1|
nltk                                                            |          1|
дашборд                                                         |          1|
Пусконаладочные работы                                          |          1|
CJM                                                             |          1|
ERP-системы на базе 1С                                          |          1|
Дашборд                                                         |          1|
Atlassian Jira                                                  |          1|
Appsflyer                                                       |          1|
WoE                                                             |          1|
MS Excel (VBA, Power Query), Python                             |          1|
Работа в условиях многозадачности                               |          1|
Разработка                                                      |          1|
Miner                                                           |          1|
PowerBL                                                         |          1|
Qlickview                                                       |          1|
HR                                                              |          1|
ORM                                                             |          1|
ArcGIS QGIS Git/Gitlab Python пространственные базы данных Agile|          1|
Ключевые навыки BI, DataLens, SQL, Python, Excel                |          1|
Развитые коммуникативные навыки                                 |          1|
Tensorflow                                                      |          1|
Поиск информации в интернет                                     |          1|
MS Outlook                                                      |          1|
аналитика данных                                                |          1|
PowerBI                                                         |          1|
Знание MS Office                                                |          1|
PySpark                                                         |          1|
Консультирование клиентов                                       |          1|
XML                                                             |          1|
Закупки                                                         |          1|
1С:                                                             |          1|
Продуктовая аналитика                                           |          1|
Computer Vision                                                 |          1|
Qlik Sense                                                      |          1|
репутационный маркетинг                                         |          1|
Грамотность                                                     |          1|
Экономический анализ                                            |          1|
1С: Торговля                                                    |          1|


-- На первых позициях анализ данных и SQL - два основных навыка аналатика. Пробежавшись по таблице можно заметить, что остальные навыки являются частными проявлениям двух лидирующих навыков или, наоборот, являются узконаправленными умениями под конкретные задачи